import { Icons } from './icons';

// 自定义图标
import SettingsInputAntennaIcon from '@material-ui/icons/SettingsInputAntenna';
import WbIridescentIcon from '@material-ui/icons/WbIridescent';
import BusinessCenterIcon from '@material-ui/icons/BusinessCenter';
import ComputerIcon from '@material-ui/icons/Computer';
import InfoIcon from '@material-ui/icons/Info';
import RateReviewIcon from '@material-ui/icons/RateReview';
import { ReactComponent as ParateraIcon } from '../assets/icons/paratera.svg';
import { ReactComponent as FyIcon } from '../assets/icons/fuyaogroup.svg';

// 自定义组件
import CircleButton from '../components/CircleButton/CircleButton';

// 顶部区域和页脚的通用配置
const CommonConfig = {
    // 是否开启首页通知
    addNotice: false,
    name: '谭满堂',
    tagline: 'HPC运维工程师',
    signature: {
        // 签名 SVG 的视口
        viewBox: '0 0 100 100',
        // 这是 SVG 中 <path> 标签的 "d" 属性路径数据，用于绘制图形
        // https://www.jyshare.com/more/svgeditor/  这是一个 SVG 编辑器，你可以在其中绘制 SVG 路径数据
        signaturePathD: `m11.75819,33.00009c0,0.25 0.18728,0.74224 0.25,1.49999c0.04124,0.49829 0.0049,1.5187 0.375,3.49998c0.18927,1.01325 0.56838,2.88903 0.75,3.49998c0.19181,0.64524 0.25,1.125 0.25,1.24999c0,0 0.125,0.125 0.25,0.125c0,0 0.16161,0.08839 0.25,0c0.26516,-0.26516 0.06078,-0.85297 0.125,-1.12499c0.22975,-0.97324 0.125,-1.49999 0.125,-1.87499c0,-0.87499 0,-1.12499 0,-1.37499c0,-0.5 0,-0.625 0,-0.75c0,-0.125 0,-0.25 0,-0.5c0,-0.25 0,-0.75 0,-1.24999c0,-0.5 0,-1.24999 0,-1.49999c0,-0.625 0,-0.875 0,-0.99999c0,-0.375 0,-0.5 0,-0.5c0,-0.125 0.12002,-0.2605 0.375,-0.375c0.61407,-0.27576 0.96399,-0.4977 1.62499,-0.625c0.36823,-0.07092 0.99999,-0.25 1.74999,-0.25c0.5,0 1.87499,0 2.49999,0c0.5,0 1.24999,0.125 1.37499,0.25c0.125,0.125 0.39663,0.35659 0.5,0.5c0.16343,0.22675 0.125,0.25 0.125,0.5c0,0.25 0,0.375 0,0.5c0,0.125 0.03574,0.40146 -0.25,0.75c-0.22415,0.27342 -0.58657,0.77324 -0.75,0.99999c-0.20672,0.28682 -0.75,0.5 -0.99999,0.625c-0.75,0.375 -1.12002,0.51049 -1.37499,0.625c-0.61407,0.27576 -0.79836,0.3647 -1.12499,0.5c-0.23097,0.09567 -0.3595,0.16789 -0.99999,0.375c-0.49039,0.15857 -0.90799,0.31383 -1.87499,0.875c-0.38981,0.22621 -1.39162,0.94618 -1.87499,1.12499c-0.26215,0.09697 -0.75,0.5 -0.75,0.625c0,0 -0.07664,0.3647 0.25,0.5c0.46194,0.19134 2.10644,0.37439 3.37498,0.5c0.99513,0.09854 2.97942,0.12425 4.12498,0.25c0.86977,0.09547 2.02853,0.10649 2.37499,0.25c0.32664,0.1353 0.25,0.375 0.25,0.5c0,0.125 0,0.375 -0.125,0.5c-0.375,0.375 -0.95788,0.58297 -2.37499,1.24999c-1.21809,0.57335 -3.53686,1.26889 -4.74998,1.74999c-1.03929,0.41216 -3.02776,1.56109 -3.37498,1.74999c-0.70308,0.38249 -0.67755,0.63572 -0.75,0.875c-0.1306,0.43135 -0.28429,0.61062 -0.375,0.875c-0.20685,0.60287 -0.125,0.87499 -0.125,1.12499c0,0.375 -0.1015,0.75325 0.5,1.12499c0.67249,0.41563 2.74999,0.625 3.62498,0.625c1.12499,0 3.12754,0.06186 3.87498,0c0.75775,-0.06271 0.85011,-0.13307 0.75,-0.75c-0.06332,-0.39018 -0.58008,-1.5076 -0.75,-2.37499c-0.29722,-1.51732 -0.47017,-2.50557 -0.625,-3.24998c-0.31484,-1.51376 -0.59946,-2.01138 -1,-2.87498c-0.1176,-0.25356 -0.10136,-0.37275 -0.125,-0.25c-0.1273,0.661 -0.25,0.875 -0.375,1.49999c-0.25,1.24999 -0.3799,1.89369 -0.75,3.87498c-0.18927,1.01325 -0.47344,2.25678 -1.12499,4.74998c-0.36035,1.3789 -0.84533,3.75628 -1.12499,4.99997c-0.22614,1.00566 -0.75,2.49998 -1.12499,3.24998c-0.375,0.75 -0.46168,0.93235 -0.625,1c-0.11548,0.04784 -0.125,-0.25 -0.125,-0.5c0,-0.5 0.20065,-2.02283 0.625,-2.87498c0.44922,-0.90211 1.42644,-2.42548 1.87499,-2.99998c0.43516,-0.55735 0.63723,-0.72805 0.875,-0.875c0.10633,-0.06572 0.13573,-0.07244 0.375,0c0.43135,0.1306 1.49999,0.75 2.24999,0.99999c0.75,0.25 2.15424,0.68661 2.74998,1c1.19662,0.62946 1.67959,1.12659 2.49999,1.49999c1.29717,0.5904 2.1142,0.80025 3.74998,1.12499c0.74579,0.14806 1.49574,0.43744 2.87498,0.5c0.62435,0.02832 1.37499,0 2.74998,0c0.375,0 1.12499,-0.375 1.24999,-0.5c0.125,-0.125 0.61843,-1.12721 0.87499,-1.87499c0.73133,-2.13148 0.94736,-3.25971 1.24999,-4.74997c0.63956,-3.14944 0.76687,-4.79828 1.49999,-7.74996c0.38113,-1.53451 0.56379,-2.75763 0.87499,-4.99997c0.10452,-0.75312 0.125,-1.49999 0.125,-2.74999c0,-0.5 0,-0.99999 0,-0.99999c0,-0.125 0,0.25 0,0.99999c0,0.75 -0.18698,1.97903 -0.375,4.49998c-0.11156,1.49584 0,4.99997 0,6.62497c0,1.62499 0,4.12498 0,5.12497c0,0.99999 0.24656,2.70592 0.375,3.24998c0.11488,0.48662 -0.08839,0.66161 0,0.75c0.08839,0.08839 0.31673,-0.00907 0.25,-0.25c-0.19456,-0.70242 -0.67911,-1.3503 -1,-2.12499c-0.90761,-2.19116 -1.22646,-3.38047 -1.49999,-4.49997c-0.46058,-1.88506 -0.81234,-2.61833 -0.87499,-3.49998c-0.00886,-0.12469 0,-0.25 0,-0.375c0,0 -0.01841,-0.27164 0.125,-0.375c0.22675,-0.16343 0.50374,-0.06391 0.99999,-0.125c1.02305,-0.12594 1.74999,-0.375 2.24999,-0.375c1.37499,0 1.99999,0 3.24998,0c0.75,0 1.30291,0.17853 1.99999,0.75c0.41013,0.33622 1.09618,1.04887 1.37499,1.49999c0.20781,0.33625 0.875,1.62499 1.125,1.99999c0.25,0.375 0.71156,1.14825 0.87499,1.37499c0.10336,0.14341 0.13451,0.17284 0.25,0.125c0.16332,-0.06765 0.33926,-0.27645 0.625,-0.625c0.4483,-0.54683 0.46426,-0.77645 0.75,-1.12499c0.11208,-0.13671 0.25,-0.125 0.5,-0.125c2.12499,0 3.74391,-0.08974 8.62495,-0.375c3.12216,-0.18246 6.46761,-0.33647 11.24994,-1.62499c1.4127,-0.38063 2.79641,-1.21834 3.12498,-1.74999c0.29389,-0.47552 0.11815,-2.49915 0,-3.49998c-0.1327,-1.12411 -0.55674,-3.77508 -0.99999,-4.87497c-1.08675,-2.69667 -1.94593,-3.66296 -2.74998,-4.74998c-1.05649,-1.4283 -1.34548,-1.87499 -1.62499,-1.87499c-0.27951,0 -0.09058,0.75655 -0.25,1.49999c-0.51492,2.40126 -1.03844,4.21193 -2.12499,9.24995c-0.58926,2.73225 -1.10848,5.60089 -2.24999,10.99994c-0.55275,2.61438 -1.12478,7.73897 -1.24999,9.87495c-0.08046,1.37263 -0.14351,3.15353 0,3.49998c0.06765,0.16332 0.42218,0.27118 0.625,0.125c0.96201,-0.69338 0.52416,-1.72697 0.625,-2.87498c0.25179,-2.86666 -0.11393,-4.51622 -0.375,-6.12497c-0.41278,-2.54365 -1.30944,-3.57412 -1.49999,-4.62497c-0.0223,-0.12299 -0.03661,-0.21339 -0.125,-0.125c-0.35355,0.35355 -0.01941,1.3895 -1,2.74998c-0.62017,0.86045 -2.22037,2.17256 -2.99998,2.62498c-0.4835,0.28059 -0.875,0.375 -0.875,0.375c0.5,-0.375 1.34395,-0.94137 2.62498,-1.49999c1.95793,-0.85379 8.13764,-2.45814 11.49994,-3.49998c4.26673,-1.32209 5.88051,-1.7971 6.74997,-2.49999c1.24487,-1.00637 1.37438,-1.73144 1.49999,-2.99998c0.07391,-0.74635 0,-1.49999 0,-2.99998c0,-0.75 0.18319,-1.97975 0.37499,-2.62498c0.18162,-0.61095 0.125,-1 0.125,-1.125c0,-0.125 0.05735,-0.28832 0.125,-0.125c0.04784,0.11549 0.14304,0.36677 0.25,0.625c0.15127,0.3652 0.40146,0.96426 0.74999,1.25c0.27341,0.22415 1.39162,0.94618 1.87499,1.12499c0.78644,0.29092 0.99999,0.375 0.99999,0.5c0,0.125 0.03622,0.38036 0,0.5c-0.1306,0.43135 -0.39462,0.86633 -1.62498,1.87499c-0.69708,0.57147 -2.6548,2.09605 -3.62498,3.12498c-1.03261,1.09513 -2.62251,3.05814 -3.12498,4.12498c-0.50529,1.07281 -1.1865,3.47611 -1.49999,4.37498c-0.46933,1.34571 -0.64303,1.99176 -0.74999,2.24999c-0.15127,0.36519 -0.125,0.5 -0.125,0.625c0,0.125 -0.15302,0.48785 -0.25,0.75c-0.17881,0.48337 -0.11307,0.87216 0,1.37499c0.13983,0.62185 0.27784,0.96549 0.75,1.37499c0.26709,0.23164 0.48846,0.43702 0.99999,0.5c0.37219,0.04582 0.5,0 1.49999,-0.25c0.99999,-0.25 2.10392,-0.48161 4.37498,-0.87499c0.99299,-0.172 2.41232,-0.49357 2.62498,-0.625c0.23776,-0.14694 0.375,-0.5 0.375,-0.5c0,-0.25 0.06493,-0.87984 0.125,-1.24999c0.12663,-0.78036 0.23139,-1.14171 0.37499,-1.74999c0.06422,-0.27203 0.125,-0.625 0.125,-0.75c0,-0.25 0,-0.375 0,-0.625c0,-0.25 0.07323,-0.55177 0.25,-0.375c0.17677,0.17678 0.27219,0.6143 0.625,1.37499c0.40054,0.8636 1.02372,3.0507 1.62499,4.12498c1.18537,2.11789 1.82466,3.03821 2.49998,3.87498c1.16705,1.44605 1.37499,1.62499 1.49999,1.74999l0,0.125`

    },
    email: 'tanmantang@foxmail.com',
    // 社交媒体账户信息
    social: [
        {
            name: 'QQ',
            link: 'https://tanmantang.oss-cn-chengdu.aliyuncs.com/public/qq.png',
            icon: Icons['qq']
        },
        {
            name: '微信',
            link: 'https://tanmantang.oss-cn-chengdu.aliyuncs.com/public/weixin.png',
            icon: Icons['weixin']
        },
        {
            name: 'GitHub',
            link: 'https://github.com/tangmantan',
        },
        {
            name: 'gitee',
            link: 'https://gitee.com/tanmantang',
        },
        {
            name: '邮箱',
            link: 'mailto:tanmantang@foxmail.com',
            icon: Icons['email']
        },
    ]
};

/** 项目部分的配置 */
const ProjectsConfig = {
    
    projects: [
        {
            name: '招商局重庆交通科研设计院有限公司',
            icon: Icons['zhaoshangju'],
            description: '重构了公司的IT系统，整合了公司的IT资源，优化IT部研发效率，提高了IT系统的效率和可靠性。',

            links: [
                {
                    tooltip: '官网地址',
                    link: 'https://www.cmct.cn/',
                    icon: Icons['link']
                },
            ]
        },
        {
            name: '重庆长安汽车股份有限公司',
            icon: Icons['changan'],
            description: '重新优化行人碰撞检测算法，提高了碰撞检测的准确性和效率，减少了碰撞事故的发生。使用HPC对流体等加速计算',
            links: [
                {
                    tooltip: '官网地址',
                    link: 'https://www.changan.com.cn/',
                    icon: Icons['link']
                }
            ]
        },
        {
            name: '福耀集团',
            icon: <FyIcon width={80} height={30} fill='currentColor' />,
            description: '2018年福耀欧洲新厂正式投产，同期担任技术经理派往欧洲指导技术工作',
            links: [
                {
                    tooltip: '官网地址',
                    link: 'https://www.fuyaogroup.com/',
                    icon: Icons['link']
                }
            ]
        },
        {
            name: '北京并行科技股份有限公司',
            icon: <ParateraIcon width={120} height={30} fill='currentColor' />,
            description: '一家全国数一数二的高性能计算服务供应商，在职期间曾担任运维工程师，安全高效的保障了公司千台服务器稳定运行，编写代码对高性能计算集群的精准调度以及分配，让客户沉浸在更快、更准、更稳的计算中。',
            links: [
                {
                    tooltip: '官网地址',
                    link: 'https://www.paratera.com/',
                    icon: Icons['link']
                }
            ]
        },
    ]
};

const CustomSectionsConfig = [
    {
        name: '任职经历',
        headerIcon: Icons['company'],
        // 应用样式的额外类
        // "section-reverse" 类使区域从右到左排列
        extraClass: '',
        // 如果你不希望菜单中显示，将此设置为 true
        notInMenu: false,
        content: (
            <>
                {ProjectsConfig.projects.map((project, index) => {
                    return (
                        <div key={'project-' + index}>
                            <h3 style={{ fontSize: '1.4rem' }}>{project.icon} {project.name}
                                    {project.links.map((link, linkIndex) => {
                                    return (
                                        <CircleButton className="project-link" key={'project-link-' + index + linkIndex} link={link.link} 
                                            target="_blank" tooltip={link.tooltip} size={1.4}>
                                            {link.icon}
                                        </CircleButton>
                                    );
                                })}
                            </h3>
                            <p style={{paddingBottom: '3rem'}}>{project.description}</p>
                        </div>
                    );
                })}
            </>
        )
    },
    {
        name: '关于我',
        headerIcon: <InfoIcon />,
        extraClass: 'about-section section-reverse',
        content: (
            <>
                <h4>这帅气小伙是谁{Icons['helpoutline']}</h4>
                <p> 一个资深运维工程师，专注于服务器运维管理和技术研究，喜欢动漫、游戏(最近喜欢上了户外)和研究AI技术相关内容的人儿</p>
                <h4>我会的一些技能</h4>
                <h3>{Icons['code']} 后端</h3>
                <p className="programming-icons">
                    {Icons['java']}
                    {Icons['php']}
                    {Icons['mysql']}
                    {Icons['redis']}
                    {Icons['dameng']}
                    {Icons['python']}
                </p>

                <h3>{Icons['web']} 前端</h3>
                <p className="programming-icons">
                    {Icons['javascript']}
                    {Icons['nodejs']}
                    {Icons['react']}
                    {Icons['vue']}
                    {Icons['nginx']}
                </p>
                <h3>{Icons['server']} 其他</h3>
                <p className="programming-icons">
                    {Icons['docker']}
                    {Icons['nacos']}
                    {Icons['minio']}
                    {Icons['shell']}
                </p>
            </>
        )
    },
    {
        name: '评论',
        headerIcon: <RateReviewIcon />,
        content: (
            <>
                <h4 style={{ fontSize: '2em' }}>{Icons['helpoutline']} 别人怎么说?</h4>
                <p>
                    <span style={{ fontSize: '5rem', height: '30px', display: 'block' }}>“</span>
                    <br />
                    谭满堂在长安汽车为我们做了出色的工作。他努力工作，编写了非常好且清晰易读的代码，并为该项目做出了宝贵的贡献。
                </p>
                <p>我们喜欢他非常积极、自我驱动，并且已经是一位经验丰富、知识渊博的编码员。</p>
                <p style={{ textAlign: 'right', fontSize: 'small' }}>
                    <i>
                        <b>朱华荣</b>
                        <br />
                        重庆长安汽车股份有限公司
                        <br />
                        董事长、党委书记
                    </i>
                </p>
                <p>
                    <span style={{ fontSize: '5rem', height: '30px', display: 'block' }}>“</span>
                    <br />
                    谭满堂拥有强大的技术技能，能够快速学习新技术，他非常灵活和开放，随时准备讨论自己的观点，并以深思熟虑和收集的方式思考利弊，在做出决定时考虑到他得到的反馈，而不接受任何东西，也不拒绝任何东西。
                </p>
                <p style={{ textAlign: 'right', fontSize: 'small' }}>
                    <i>
                        <b>张三 & 李四</b>
                        <br />
                        重庆市最牛逼集团
                        <br />
                        总裁 & 技术总监
                    </i>
                </p>
                <p>
                    <span style={{ fontSize: '5rem', height: '30px', display: 'block' }}>“</span>
                    <br />
                    I have really appreciated your confidence to solve problems yourself and follow your own intuition even when it goes against what I was suggesting. I feel you were mostly right :)
                </p>
                <p style={{ textAlign: 'right', fontSize: 'small' }}>
                    <i>
                        <b>James Knight</b>
                        <br />
                        GeNN Team
                        <br />
                        Research Fellow
                        <br />
                        The University of Sussex
                    </i>
                </p>
            </>
        )
    }
];

export { CommonConfig, ProjectsConfig, CustomSectionsConfig, Icons };
